{
  "startDate": "2014,5,13",
  "endDate": "",
  "prettyStartDate": "Tuesday, May 5th, 2014",
  "prettyEndDate": "",
  "startTime": "12:24:28",
  "endTime": "",
  "prettyStartTime": "12:24:28 pm",
  "prettyEndTime": "",
  "author": "admin",
  "published": "true",
  "tag": "nooline",
  "asset": {
    "media": "",
    "thumbnail": "",
    "credit": "",
    "caption": ""
  },
  "headline": "In A Little Bit More Detail",
  "text": "<p>Nooline is built on top of <a data-cke-saved-href=\"http://nodejs.org\" href=\"http://nodejs.org\" target=\"_blank\">NodeJS</a>, using modern web technologies. &nbsp;Each component it uses is focused on doing one thing only, and doing it well. &nbsp;It should require a minimal amount of time to create content or extend the platform.</p><p>Nooline is built with two key driving factors in mind:</p><ol><li>Creating and editing content on a website should be simple enough that my mother could do it (and she ain't techy).</li><li>User Experience, Extensibility, and Scalability are not orthogonal. &nbsp;We can have them in parallel.</li></ol><p>This first factor is key; most Content Management Systems nowadays require a mixture of a developer and designer skills, often times with in-depth knowledge of specific framework idiosyncracies. &nbsp;One language should be enough for the entire system, and it should follow widespread conventions such as adhering to some manner of <a data-cke-saved-href=\"https://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller\" href=\"https://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller\">MV*</a>&nbsp;framework.</p><p>The Web today consists of a myriad of device types, many of which have intermittent or often slow connectivity, and tiny screens. &nbsp;In order to scale a user experience for all of these devices, the framework running it must be able to be easily extended, and capable of scaling with minimal effort. &nbsp;We need all three.</p>",
  "uuid": "3a6db021-e669-475f-8ee0-6b6637bccdaf",
  "index": "9",
  "type": "scroll",
  "url": "/scroll/9"
}